# VS Code Insiders Extensions
# One extension ID per line, blank lines and lines starting with # are ignored
# These extensions will be automatically installed on first login

# Theme & Icons
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons

# Remote Development
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-repositories

# GitHub Integration
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
ms-vscode.azure-repos

# Python Development
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.vscode-python-envs
ms-toolsai.jupyter-keymap

# C++ Development
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.cmake-tools

# Container & Docker
ms-azuretools.vscode-containers

# RPA & Automation
robocorp.robocorp-code
sema4ai.sema4ai

# Utilities
mechatroner.rainbow-csv
ms-vscode.vscode-speech
ms-vscode.vscode-websearchforcopilot
