# VS Code Insiders Extensions
# One extension ID per line, blank lines and lines starting with # are ignored
# These extensions will be automatically installed on first login

# Theme & Icons
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons

# Remote Development
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-repositories

# GitHub Integration
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
ms-vscode.azure-repos

# Python Development
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.vscode-python-envs

# Jupyter & Notebooks
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Container & Docker
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools

# RPA & Automation
sema4ai.sema4ai

# Utilities
ms-toolsai.datawrangler
ms-vscode.vscode-speech
ms-vscode.vscode-websearchforcopilot
ms-vscode.live-server
ms-vscode.makefile-tools

# AI & Chat
openai.chatgpt

# Configuration & Languages
redhat.vscode-yaml

# Document Viewers
tomoki1207.pdf
